const initialPosts = [
  {
    "id": 1,
    "title": "首页投稿1",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":10,
    "watchcount":81
  },
  {
    "id": 2,
    "title": "首页投稿2",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":11,
    "watchcount":82
  },
  {
    "id": 3,
    "title": "首页投稿3",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":13,
    "watchcount":83
  },
  {
    "id": 4,
    "title": "首页投稿4",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":13,
    "watchcount":84
  },
  {
    "id": 5,
    "title": "首页投稿5",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":123,
    "watchcount":85
  },
  {
    "id": 6,
    "title": "首页投稿6",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":111,
    "watchcount":86
  },
  {
    "id": 7,
    "title": "首页投稿7",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":1023,
    "watchcount":87
  },
  {
    "id": 8,
    "title": "首页投稿8",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":8,
    "watchcount":88
  },
  {
    "id": 9,
    "title": "首页投稿9",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":135,
    "watchcount":89
  },
  {
    "id": 10,
    "title": "首页投稿10",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":1009,
    "watchcount":90

  },
  {
    "id": 11,
    "title": "首页投稿11",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":1234,
    "watchcount":91
  },
  {
    "id": 12,
    "title": "首页投稿12",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":89,
    "watchcount":92
  },
  {
    "id": 13,
    "title": "首页投稿13",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":90,
    "watchcount":93
  },
  {
    "id": 14,
    "title": "首页投稿14",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 3,
    "author": "yemol",
    "hotcount":91,
    "watchcount":94
  },
  {
    "id": 15,
    "title": "首页投稿15",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":92,
    "watchcount":95
  },
  {
    "id": 16,
    "title": "首页投稿16",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":93,
    "watchcount":96
  },
  {
    "id": 17,
    "title": "首页投稿17",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 2,
    "author": "yemol",
    "hotcount":94,
    "watchcount":97
  },
  {
    "id": 18,
    "title": "首页投稿18",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 1,
    "author": "yemol",
    "hotcount":95,
    "watchcount":98
  },
  {
    "id": 19,
    "title": "首页投稿19",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 3,
    "author": "yemol",
    "hotcount":96,
    "watchcount":99
  },
  {
    "id": 20,
    "title": "首页投稿20",
    "brief": "玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。投稿必须原创。如果发现有非",
    "date": "2015-09-15",
    "tagid": 3,
    "author": "yemol",
    "hotcount":97,
    "watchcount":100
  }
]

export function getPosts (req) {
  let posts = req.session.posts
  if (!posts) {
    posts = initialPosts
    req.session.posts = posts
  }
  return posts
}

export default function load (req, params) {
  return new Promise((resolve, reject) => {
    // make async call to database
    setTimeout(() => {resolve(getPosts(req))
    }, 6000) // simulate async load
  })
}
